FRIEDparrot/ClassReview/💻softwares/⚡Circuit/🎮STM32教程/模板文件/F407/Templates/Drivers/PHEPLIB/SDcard_driver/sdcard_driver.c
/* Includes ------------------------------------------------------------------*/
#include  "sdcard_driver.h"
#include  "stm32f4xx_hal_sd.h"


#include  "string.h"
#include  "stdio.h"
#include  "stdlib.h"

/* Private define ------------------------------------------------------------*/
#define MAX_ABSOLUTE_PATH_LENGTH    255

/* Private macro -------------------------------------------------------------*/

#define SD_TOTAL_SIZE_BYTE(__Handle__)  (((uint64_t)((__Handle__)->SdCard.LogBlockNbr) * ((__Handle__)->SdCard.LogBlockSize)) >> 0)
#define SD_TOTAL_SIZE_KB(__Handle__)    (((uint64_t)((__Handle__)->SdCard.LogBlockNbr) * ((__Handle__)->SdCard.LogBlockSize)) >> 10)
#define SD_TOTAL_SIZE_MB(__Handle__)    (((uint64_t)((__Handle__)->SdCard.LogBlockNbr) * ((__Handle__)->SdCard.LogBlockSize)) >> 20)
#define SD_TOTAL_SIZE_GB(__Handle__)    (((uint64_t)((__Handle__)->SdCard.LogBlockNbr) * ((__Handle__)->SdCard.LogBlockSize)) >> 30)

/* Private variables ---------------------------------------------------------*/
static GPIO_InitTypeDef GPIO_InitStructure;

static SD_HandleTypeDef        sd_handler;
static HAL_SD_CardInfoTypeDef  sd_info_Structure;
static HAL_SD_CardCSDTypeDef   sd_csd_structure;
static HAL_SD_CardCIDTypeDef   sd_cid_Structure;

static FATFS fs;
static char fs_buffer[512];     /* global variable for fs buffer */
static uint16_t sdcard_file_counter = 0;

// static SDIO_CmdInitTypeDef     sd_cmd_InitStructure;
// static SDIO_DataInitTypeDef    sd_data_InitStructure;

/* Private function prototypes -----------------------------------------------*/
static uint8_t _sd_file_available_cb(FILINFO fno);
static uint8_t _sd_count_filenumber_cb(FILINFO fno);

static uint8_t _sd_combine_dir(const char* root_dir, const char* dir, char* result_dir);
static uint8_t _sd_get_parent_path(const char* filePath, char* dst_str);
static uint8_t _sd_get_filename(const char* filePath, char* dst_str);

/* Private functions ---------------------------------------------------------*/

void HAL_SD_MspInit(SD_HandleTypeDef *hsd){
    /**  Init GPIO -------------- */ 
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
    SDCARD_CD_GPIO_CLK_ENABLE(); 
    
    /** Data GPIO Ports --------- */
    GPIO_InitStructure.Pin  = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11;
    GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull = GPIO_PULLUP;
    GPIO_InitStructure.Speed = GPIO_SPEED_FAST;
    GPIO_InitStructure.Alternate = GPIO_AF12_SDIO;   // use AF12 SDIO 
    HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
    
    /** CLK GPIO Init ---------- */
    GPIO_InitStructure.Pin = GPIO_PIN_12;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);

    /** Command GPIO Init ------ */
    GPIO_InitStructure.Pin = GPIO_PIN_2;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStructure);
    
    /** CD GPIO CLK ------------ */
    GPIO_InitStructure.Pin = SDCARD_CD_GPIO_PIN;
    GPIO_InitStructure.Mode = GPIO_MODE_INPUT;   // floating (must be pull up with resistance)
    GPIO_InitStructure.Pull = GPIO_NOPULL;
    GPIO_InitStructure.Alternate = 0;
    HAL_GPIO_Init(SDCARD_CD_GPIO, &GPIO_InitStructure);
    
    /** Init Clock of SDIO ----- */
    __HAL_RCC_SDIO_CLK_ENABLE();
}

/// @brief retrieve judge if file is available 
/// @param fno 
/// @note The file/sub-directory must not have read-only attribute (AM_RDO), or the function will be rejected with FR_DENIED.
///       The sub-directory must be empty and must not be current directory, or the function will be rejected with FR_DENIED.
///       The file/sub-directory must not be opened, or the FAT volume can be collapsed. It will be rejected safely when file lock function is enabled.
/// @return 
static uint8_t _sd_file_available_cb(FILINFO fno){
    if ((fno.fattrib & AM_HID) || (fno.fattrib & AM_RDO)) return 1;
    return 0;
}

// 2. The sub-directory must be empty and must not be current director

/// @brief call back function for counting file number 
/// @param fno 
/// @note set sdcard_file_counter to 0 before counting 
/// @return 
static uint8_t _sd_count_filenumber_cb(FILINFO fno){
    if (!(fno.fattrib & AM_DIR)) {
        if (fno.fattrib & AM_HID) return 0; 
        sdcard_file_counter++;
    }
    return 0;
}

/// ========  several string processing functions =========

/// @brief combine the root directory and directory using "/"
/// @param root_dir     if use NULL, will not combine it.
/// @param dir          root directory;
/// @param result_dir   use char* dir = NULL and use it address for it.
/// @warning  dst_str must have enough space (MAX_ABSOLUTE_PATH_LENGTH) to receive data;
/// @return 0: combine succeed;   1: failed;
static uint8_t _sd_combine_dir(const char* root_dir, const char* dir, char* result_dir){
    if (strlen(root_dir) + strlen(dir) + 2 > MAX_ABSOLUTE_PATH_LENGTH) return 1;
    memset(result_dir, 0, strlen(result_dir));
    sprintf(result_dir, "%s/%s",root_dir, dir);
    return 0;
}

/// @brief get the absolute path of the parent path 
/// @param filePath 
/// @param dst_str 
/// @return 0: succeed;   1: failed;
/// @warning  dst_str must have enough space
static uint8_t _sd_get_parent_path(const char* filePath, char* dst_str){
    if (strlen(filePath) > MAX_ABSOLUTE_PATH_LENGTH) return 1;
    strcpy(dst_str, filePath);
    char* lastSlash = strrchr(dst_str, '/');
    if (lastSlash != NULL) {
        (*lastSlash) = '\0';    // set it to end character 
        return 0;
    }
    return 1;  // can't find the parent dir 
}

/// @brief get the file or folder name from the path 
/// @param filePath 
/// @param dst_str 
/// @return 0: succeed;   1: failed;
/// @warning the dst_str must have enough space for filePath or HardFault will happen;
static uint8_t _sd_get_filename(const char* filePath, char* dst_str){
    if (strlen(filePath) > MAX_ABSOLUTE_PATH_LENGTH) return 1;
    const char* lastSlash = strrchr(filePath,'/');
    if (lastSlash !=NULL){
        strcpy(dst_str,lastSlash+1);
        return 0;
    }
    return 1;
}

