FRIEDparrot/ClassReview/💻softwares/⚡Circuit/🎮STM32教程/模板文件/F407/Templates/Drivers/PHEPLIB/SDcard_driver/sdcard_driver.c
/* Public functions -----------------------------------------------------------*/

/// @brief Init SD Card
/// @return 
SDCard_Err SDCard_init(void){
    sd_handler.Instance = SDIO;
    sd_handler.Init.BusWide         = SDIO_BUS_WIDE_1B;   // use DAT_0 for initialization
    sd_handler.Init.ClockBypass     = SDIO_CLOCK_BYPASS_DISABLE;
    /** In the Init Function,  the CLK_DIV will be set to SDIO_INIT_CLK_DIV automatically */ 
    sd_handler.Init.ClockDiv        = SDIO_TRANSFER_CLK_DIV;
    sd_handler.Init.ClockEdge       = SDIO_CLOCK_EDGE_RISING;
    sd_handler.Init.ClockPowerSave  = SDIO_CLOCK_POWER_SAVE_DISABLE;
    sd_handler.Init.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;   // disable the hardware flow control
    if (HAL_SD_Init(&sd_handler) != HAL_OK){
        return INITERR;
    }
    HAL_SD_GetCardInfo(&sd_handler, &sd_info_Structure);
    HAL_SD_GetCardCID(&sd_handler,&sd_cid_Structure);
    HAL_SD_GetCardCSD(&sd_handler,&sd_csd_structure);

    // change transfer type to 4 line transfer mode;
    if (HAL_SD_ConfigWideBusOperation(&sd_handler, SDIO_BUS_WIDE_4B)!=HAL_OK){
        return INITERR;
    }
    return NOERR;
}

/// @brief Init SD Card with File System 
/// @param  
/// @return 
SDCard_Err SDCard_initFS(void){
    FRESULT res =  f_mount(&fs, SDCARD_ROOTDIRECTORY, 1);
    if (f_mount(&fs, SDCARD_ROOTDIRECTORY, 1) == FR_OK){
        return NOERR;
    }
    else if (res == FR_NO_FILESYSTEM){
        /** begin format W25Qxx */
        res = f_mkfs(SDCARD_ROOTDIRECTORY, 0, fs_buffer, SDCARD_SECTOR_SZ);
        if (res == FR_OK) {
            printf("format W25Qxx suc: %d\r\n", res);
            res = f_mount(&fs, SDCARD_ROOTDIRECTORY, 1);
            if (res == FR_OK){
                return NOERR;
            }
        }
    }
    return INITERR;
}

/// @brief Read sector Block data from sd card 
/// @param hsd  sd card handler typedef 
/// @param buff buffer (size = 512 * N)
/// @param saddr addr of first sector to read 
/// @param sec_cnt count of sector 
/// @return 
SDCard_Err SDCard_ReadBlock(uint8_t *buff, uint32_t saddr, uint32_t sec_cnt){
    __disable_irq();
    HAL_StatusTypeDef res = HAL_SD_ReadBlocks(&sd_handler, buff, saddr, sec_cnt, SDMMC_DATATIMEOUT);
    __enable_irq();

    if (res!= HAL_OK) return FileReadERR;
    return SDCard_WaitBusy();
}

/// @brief Write Block 
/// @param buff 
/// @param saddr 
/// @param sec_cnt 
/// @return 
SDCard_Err SDCard_WriteBlock(uint8_t *buff, uint32_t saddr, uint32_t sec_cnt)
{
    __disable_irq();
    HAL_StatusTypeDef res = HAL_SD_WriteBlocks(&sd_handler, buff,  saddr, sec_cnt, SDMMC_DATATIMEOUT);
    __enable_irq();
    if  (res!= HAL_OK) return FileWriteERR;

    return SDCard_WaitBusy();
}

/// @brief called when re-get infomation 
/// @param  
void SDCard_getinfo(void){
    HAL_SD_GetCardInfo(&sd_handler, &sd_info_Structure);
}


SDCard_Err SDCard_WaitBusy(void){
    uint32_t timeout = SDMMC_DATATIMEOUT;
    while (HAL_SD_GetCardState(&sd_handler) != HAL_SD_CARD_TRANSFER){
        if (timeout-- == 0) return TIMEOUTERR;
    }
    return NOERR;
}

/// @brief get sector size
/// @param  
/// @return 
uint32_t SDCard_GetSectorSize(void){
    return SDCARD_SECTOR_SZ;
}

/// @brief get sector count 
/// @param  
/// @return 
uint32_t SDCard_GetSectorCount(void){
    return sd_info_Structure.BlockNbr * (sd_info_Structure.BlockSize/SDCARD_SECTOR_SZ);
}

/// @brief get erase block size in unit of sector 
/// @param  
/// @return 
uint32_t SDCard_GetBlockSize(void){
    return sd_csd_structure.EraseGrSize;
}

/// @brief 
/// @param  
/// @return CARD_V1_X (0U) or  CARD_V2_X (1U)
void SDCard_GetType(uint8_t *type, uint8_t *version){
    (*type) = sd_info_Structure.CardType;
    (*version) = sd_info_Structure.CardVersion;
}

/// @brief Get the space of SD Card 
/// @param totalspace 
/// @param freespace 
/// @warning only works correctly when clust 512kb 
/// @return 
SDCard_Err SDCard_GetSpace(uint32_t* totalspace, uint32_t* freespace){
    DWORD freeclst;
    FATFS *fs;
    if (f_getfree(SDCARD_ROOTDIRECTORY, &freeclst, &fs)) return NoInfo;
	
    // for clust is always 512 kb (csize : sector per cluster)
    *totalspace = (fs->n_fatent - 2) * fs->csize /2; // (fs.n_fatent - 2) * 512/1024 
    *freespace  = freeclst * fs->csize /2;

    return NOERR;
}


/// @brief Write a info file for SD card and log its type, serial number, etc. 
/// @param 
/// @return 
SDCard_Err SDCard_WriteInfoFile(void){
    FIL fp; FRESULT res; SDCard_Err result = NOERR;
    uint32_t tot_space, free_space;
    
    char result_dir[MAX_ABSOLUTE_PATH_LENGTH];
    _sd_combine_dir(SDCARD_ROOTDIRECTORY, "cardinfo.txt", result_dir);  // create cardinfo.txt at root directory
    res = f_open(&fp, result_dir, FA_CREATE_ALWAYS|FA_WRITE);
    
    if (res != FR_OK) { f_close(&fp);  return FileOpenERR;} 
    // try write the SD Card Multipule times and just check the last res
    char* msg[10];
    msg[0] = "=============== SD card Infomation Logs ===============\r\n";
    
    uint8_t card_type, card_version;
    
    SDCard_GetType(&card_type, &card_version);
    if (SDCard_GetSpace(&tot_space, &free_space)!=NOERR) return NoInfo;
    
    switch (card_version)
    {
    case CARD_V1_X:
        msg[1] = "Type : SD Card V1.0 Card\r\n"; break;
    case CARD_V2_X:
        if (card_type == CARD_SDSC){
            msg[1] = "Type : SD Standard Capacity Card (SDSC) V2.0\r\n";
        }
        else if (card_type == CARD_SDHC_SDXC){
            msg[1] = "Type : SD High Capacity Card (SDHC) V2.0\r\n";
        }
        else{
            msg[1] = "Type : Secured SD Card V2.0\r\n"; 
        }
        break;
    }
    msg[2] = (char*)malloc(45);
    sprintf(msg[2], "total sector count: %d\r\n",SDCard_GetSectorCount());
    
    msg[3] = (char*)malloc(45);
    sprintf(msg[3], "card space total: %.2f MB\r\n", tot_space/1024.0);
    
    msg[4] = (char*)malloc(35);
    sprintf(msg[4], "card space free: %.2f MB\r\n", free_space/1024.0);
    
    msg[5] = (char*)malloc(200);
    uint16_t year  = ((sd_cid_Structure.ManufactDate & 0xFF0)>> 4) + 2000;
    uint16_t month = ((sd_cid_Structure.ManufactDate)&0xF);
    /** lu : unsigned long number */
    sprintf(msg[5], "manufacture in :%d\\%d,product serial number: %lu\r\n",year, month, (uint32_t)sd_cid_Structure.ProdSN);
    msg[6] = "Start Enjoy it!\r\n";
    for (int i = 0; i<7; i++){
       if (f_puts(msg[i], &fp)<0) result = FileWriteERR;
    }
    free(msg[2]); free(msg[3]); free(msg[4]); free(msg[5]);  // free the space after construct
    f_close(&fp);
    return result;
}





/// @brief Create File in the specified directory
/// @param path_to_create  create at root use "root_directory", or use "current_directory"
/// @param dir      directory to be created (abs shouldn't exceed MAX_ABSOLUTE_PATH_LENGTH characters)
/// @param override if set to false return error when file exists.
/// @return 
SDCard_Err SDCard_CreateFile(const char* path, bool override){
    FIL file; FRESULT res;
    SDCard_Err result = NOERR;
    if (!override){
        res = f_open(&file, path, FA_CREATE_NEW);
    }
    else{
        res = f_open(&file, path, FA_CREATE_ALWAYS);
    }
    if (res!=FR_OK) result = FileCreateERR;
    f_close(&file);
    return result;
}

/// @brief write to specified file (if file not exists, it would create).
/// @param path_to_create create at root use "root_directory", or use "current_directory"
/// @param dir       directory of the file 
/// @param write_buf the string to write to the file 
/// @param append    if set to false, open mode "w", true -> "a"
/// @note  this function can only write file < 512bytes, but can switch to append mode;
/// @return 
SDCard_Err SDCard_WriteFile(const char* path, const char* write_buf, bool append){
    // try create a file in SD card;
    FIL file;  FRESULT res; SDCard_Err result = NOERR;
    UINT write_size;                              // note: this just receives the number of bytes written 
    BYTE write_mode = FA_CREATE_ALWAYS|FA_WRITE;       // "w" for not append, "a" for append
    if (append) write_mode = FA_OPEN_APPEND|FA_WRITE; 
    
    res = f_open(&file, path, write_mode);  // must use result dir for it. 
    if ((res&FR_DENIED) == FR_DENIED) return StorgeFull;
    else if(res != FR_OK) return FileCreateERR;
    
    // write the string (note: use strlen() not use sizeof())
    res = f_write(&file, write_buf, strlen(write_buf), &write_size); if (res != FR_OK) result = FileWriteERR;
    f_close(&file);
    return result; 
}

/// @brief Create Directory on SD card Disk, if it exits, it not create it. 
/// @param path_to_create if create at root use "root_directory", or use "current directory"
/// @param dir folder directory (depend on "path_to_create" specified) 
/// @return 
SDCard_Err SDCard_CreateFolder(const char* path){
    FRESULT res;
    DIR dir;

    res = f_opendir(&dir, path);
    if (res!=FR_OK){
        res = f_mkdir(path);  // try to create 
    }
    f_closedir(&dir);  // try close dir;
    if (res!=FR_OK) return  FileCreateERR;
    return NOERR;
}

/// @brief Delete the file or folder (use retrieve option to delete all in the folder)
/// @param path 
/// @param retrieve  if set to false, it would failed if the folder is not empty.
/// @note  all files under the folder  must be deleteable (not Hidden and not read-only);
/// @return 
SDCard_Err SDCard_DeleteFolder(const char* path, bool retrieve){
    SDCard_Err result = NOERR;
    FRESULT res;
    FILINFO fno;
    
    if (f_stat(path, &fno) || (fno.fattrib & AM_HID) || (fno.fattrib & AM_RDO)) return FileInfoERR;
    if(!retrieve) {
        res = f_unlink(path);
        if (res!= FR_OK) result = DirDeleteERR;
    }else{
        if (fno.fattrib & AM_DIR){
            DIR dir;
            if (f_opendir(&dir,path)!=FR_OK) return DirOpenERR;
            while (1){
                char res_dir[MAX_ABSOLUTE_PATH_LENGTH];
                res = f_readdir(&dir, &fno);
                if (res!= FR_OK || fno.fname[0] == 0) break;   // read end, break normally.
                if (_sd_combine_dir(path, fno.fname, res_dir)){ result = DirCreateERR; break;}
                if (SDCard_DeleteFolder(res_dir,true)!= NOERR) { result = DirDeleteERR; break;}
                // every sub-folder and file should be deleteable 
            }
            f_closedir(&dir); 
            res = f_unlink(path);
            if (res!= FR_OK) result = DirDeleteERR;
        }else {
            return SDCard_DeleteFolder(path, false);
        }
    }
    return result;
}

#ifdef __cplusplus
extern "C"{
#endif

/// @brief read the path, and call info_func_cb with the FILINFO type infomation
/// @param path 
/// @param info_func_cb return 0 is execute succeed;
/// @return 
SDCard_Err SDCard_ListPath(const char* path, uint8_t (*info_func_cb)(FILINFO fno)){
    DIR dir;
    if (f_opendir(&dir , path)!= FR_OK) return DirOpenERR;
    FILINFO fno;
    while (1){
        FRESULT res = f_readdir(&dir, &fno);
        if (res != FR_OK || fno.fname[0] == 0) break;
        if (info_func_cb != NULL && info_func_cb(fno)) { f_closedir(&dir); return FileInfoERR;}
    }
    f_closedir(&dir);
    return NOERR;
}

/// @brief retrive all the folder and file of the "path" specified 
/// @param path 
/// @param info_func_cb 
/// @return 
SDCard_Err SDCard_ListPath_retrieve(const char* path, uint8_t (*info_func_cb)(FILINFO fno)){
    DIR dir;
    if (f_opendir(&dir, path)!=FR_OK) return DirOpenERR;
    FILINFO fno;
    while (1){
        FRESULT res = f_readdir(&dir, &fno);
        if (res!= FR_OK || fno.fname[0] == 0) break;
        if(info_func_cb!=NULL && info_func_cb(fno)) { f_closedir(&dir); return FileInfoERR;}
        if (fno.fattrib & AM_DIR){
            char str[MAX_ABSOLUTE_PATH_LENGTH];
            if (_sd_combine_dir(path, fno.fname, str)) continue;  // when the length is too long 
            SDCard_ListPath_retrieve(str, info_func_cb);
        }
    }
    f_closedir(&dir);
    return NOERR;
}


/// @brief Read the File sector by sector and each read action would call read_file func 
/// @param path 
/// @param read_file_func_cb since the funtion read by sector, it call this function every sector it read.
/// @return 
SDCard_Err SDCard_ReadFile(const char* path, uint8_t (*read_file_func_cb)(const char* buff)){
    FIL file; FRESULT res;
    UINT read_size;
    res = f_open(&file, path, FA_READ);  if (res!= FR_OK) return FileOpenERR;
    
    while (1){
        // **** important -> the btr parameter must be sizeof (read_buf) - 1, or first bit will error****
        memset(fs_buffer , 0, strlen(fs_buffer));
        res = f_read(&file, fs_buffer, sizeof(fs_buffer), &read_size);
        if (res!=FR_OK) { // if the SD card plug out, it returns.
            f_close(&file);  return FileReadERR;
        }
        if (read_file_func_cb!=NULL && read_file_func_cb(fs_buffer)){
            f_close(&file); return FileReadERR;
        }
        if (read_size == 0) break;  // the file read ended;
    }
    f_close(&file);
    return NOERR;
}

/// @brief Copy file from  the src_dir to dst_dir (will rename it.)
/// @param force_cp    if set to false, if dst_dir exists, the function will return err, true to replace the dst file.
/// @param process_func it receive the process proportion (from 0 to 100), n is number of task remained;
/// @return 
SDCard_Err SDCard_CopyFile(const char* src_dir, const char* dst_dir, bool force_cp, void (*process_func)(uint8_t prop)){
    FIL fp1, fp2;
    char BUF[MAX_ABSOLUTE_PATH_LENGTH];  // give 512byte space for buffer for faster copy and move; -> 
    FRESULT res;  FILINFO fno;
    UINT read_size, write_size;
    SDCard_Err result = NOERR;
    if (strcmp(src_dir, dst_dir) == 0) return FileCreateERR;
    
    res = f_open(&fp1, src_dir, FA_READ);  
    if (res != FR_OK) return FileOpenERR;
    res = f_stat(src_dir, &fno); if (res != FR_OK || (fno.fattrib & AM_HID)) {
        f_close(&fp1); return FileOpenERR;
    }  // can't copy hidden files
    
    if (force_cp){
        res = f_open(&fp2 , dst_dir, FA_WRITE|FA_CREATE_ALWAYS);
    }else{
        res = f_open(&fp2 , dst_dir, FA_CREATE_NEW|FA_WRITE);
    }
    if (res != FR_OK) { f_close(&fp1); return FileOpenERR;}

