FRIEDparrot/ClassReview/💻softwares/⚡Circuit/🎮STM32教程/模板文件/F407/Templates/Drivers/PHEPLIB/SDcard_driver/sdcard_driver.c
    uint32_t space_tot = f_size(&fp1)/1024 * 2;   // the total space in sector (1 sector = 512byte )
    uint32_t space_cp  = 0;                       // the sector that copied
    
    while (1){
        res = f_read(&fp1, BUF, sizeof(BUF), &read_size);
        if (res!=FR_OK) {
            result = FileReadERR; break;  // if the SD card plug out, it occurs 
        }
        if (read_size == 0) break;        // eof error or break interval;
        res = f_write(&fp2, BUF, read_size, &write_size);
        if (res!=FR_OK) {
            result = FileWriteERR; break; // the destination can't be written.
        }
        space_cp += 1;    // 512 byte copied;
        if (process_func!=NULL) process_func((int)((float)space_cp/space_tot * 100));
        if (write_size < read_size) break;    //  disk full error
    }
    
    f_close(&fp1); f_close(&fp2);
    return result;
}



/// @brief Copy Folder or file to the "dest_fold_dir" location. (if the dst_fold_dir not exist, will try create it)
/// @param src_dir      
/// @param dst_fold_dir directory for destination folder
/// @param force_cp     if force to copy files if file already exist.
/// @param process_func  receive the process proportion (from 0 to 100), n is number of task remained 
///            (use sdcard_file_counter for remain file to copy);
/// @note  call SDCard_ListPath_retrieve first to get files to cp in user_copy function 
/// @return 
SDCard_Err SDCard_CopyFolder(const char* src_dir, const char* dst_fold_dir, bool force_cp, void (*process_func)(uint8_t prop)){
    FRESULT res;
    FILINFO fno, fno_child;   // fno : info of parent folder;  fno_child: info of child foldder
    DIR dir;                  // firstly, will create directory under the dst_fold_dir 
    char path1[MAX_ABSOLUTE_PATH_LENGTH];
    _sd_get_parent_path(src_dir, path1);

    // avoid to copy to the same place or hidden file 
    if (strcmp(path1, dst_fold_dir) == 0) return DirCreateERR;  
    if (f_stat(src_dir, &fno)  ||  (fno.fattrib & AM_HID)) return FileInfoERR;
    
    // in this loop, each file directory is listed as result_dir
    if (fno.fattrib & AM_DIR){
        char path2[MAX_ABSOLUTE_PATH_LENGTH];
        /* if not exist, try create this directory.(include the dst_folder and under dst_dir)*/
        if (SDCard_CreateFolder(dst_fold_dir) || 
            _sd_combine_dir(dst_fold_dir, fno.fname, path2) || 
                (SDCard_CreateFolder(path2)))
            return DirCreateERR;

        if (f_opendir(&dir,src_dir)!= FR_OK) return DirOpenERR;
        // use path2 as the dst folder name; path 1 as fully name of files in src folder;
        while (1){    // List Path and copy every file to the destination.            
            res = f_readdir(&dir, &fno_child);      // read the directory and get the name 
            if (_sd_combine_dir(src_dir, fno_child.fname, path1)) {
                f_closedir(&dir); return DirCreateERR;
            }
            if (res!= FR_OK || fno_child.fname[0] == 0) break;     // read end
            if (SDCard_CopyFolder(path1, path2, force_cp, NULL)!=FR_OK){
                // copy folder retrieve. also tip when
                /* SDCard_File_Error Handeler ............ */  
            }
        }
        f_closedir(&dir);
    }
    else  // if src_dir is a file, copy the file to destination
    {
        SDCard_Err result = SDCard_CreateFolder(dst_fold_dir);
        if (result) return DirCreateERR;
        if (_sd_combine_dir(dst_fold_dir, fno.fname, path1)) return DirCreateERR;
        if (SDCard_CopyFile(src_dir, path1, force_cp, process_func)!=FR_OK){
            // jump the invalid file copy. 
            /* SDCard_File_Error Handeler ............ */
        }
        if (sdcard_file_counter) sdcard_file_counter--;
    }
    SDCard_WaitBusy();
    return NOERR;
}

/// @brief rename file or folder
/// @param path      total path of file 
/// @param path_new  total path of folder
/// @return 
SDCard_Err SDCard_RenameFolder(const char* path, const char* path_new){
    FILINFO fno;
    if (strcmp(path,path_new) == 0) return FileCreateERR;
    f_stat(path, &fno);  // firstly, judge whether path is folder or file
    if ((fno.fattrib & AM_HID) || (fno.fattrib & AM_RDO)) return FileInfoERR;
    if (f_rename(path, path_new)!=FR_OK) return DirCreateERR;
    return NOERR;
}

/// @brief Move file or folder to dst_fold_dir (if dst_folder_dir not exist, will try create it)
/// @param src_dir directory of file/folder to be moved 
/// @param dst_fold_dir directory to move to 
/// @note if same name folder already exists in dst_fold_dir, it will not move and return error
/// @return 
SDCard_Err SDCard_MoveFolder(const char* src_dir, const char* dst_fold_dir){
    FILINFO fno;
    if (f_stat(src_dir, &fno)!=FR_OK) return FileOpenERR;
    if ((fno.fattrib & AM_HID) || (fno.fattrib & AM_RDO)) return FileInfoERR;
    
    if ((fno.fattrib & AM_DIR) && SDCard_ListPath_retrieve(src_dir, _sd_file_available_cb)) return FileInfoERR;
    
    char res_dir[MAX_ABSOLUTE_PATH_LENGTH], res_dir2[MAX_ABSOLUTE_PATH_LENGTH];
    if (_sd_get_parent_path(src_dir, res_dir) || 
        (strcmp(res_dir, dst_fold_dir) == 0)  ||   // dst dir shouldn't same the dir of src_dir
        _sd_get_filename(src_dir, res_dir2)   ||
        _sd_combine_dir(dst_fold_dir, res_dir2, res_dir))
        return DirCreateERR;
    
    // first, try create dst_fold_dir
    if (SDCard_CreateFolder(dst_fold_dir)) return DirCreateERR;
    
    // res_dir is the path to create folder (if alerday exists, not do it)
    if (f_rename(src_dir, res_dir)!= FR_OK) return FileWriteERR;
    return NOERR;
}

#ifdef __cplusplus
    }
#endif // __cplusplus
